regression2/t_oltp-rw-threadpool_off/mysql-8.0.15/sysbench.1.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 160 seconds

Threads started!

[   3s] threads: 1, tps: 217.02, reads: 3038.99, writes: 868.09, response time: 6.10ms (95%), errors: 0.00, reconnects:  0.00
[   6s] threads: 1, tps: 225.00, reads: 3154.02, writes: 901.34, response time: 6.04ms (95%), errors: 0.00, reconnects:  0.00
[   9s] threads: 1, tps: 229.67, reads: 3215.35, writes: 918.67, response time: 5.94ms (95%), errors: 0.00, reconnects:  0.00
[  12s] threads: 1, tps: 226.67, reads: 3173.34, writes: 906.67, response time: 6.05ms (95%), errors: 0.00, reconnects:  0.00
[  15s] threads: 1, tps: 224.67, reads: 3145.00, writes: 897.33, response time: 6.02ms (95%), errors: 0.00, reconnects:  0.00
[  18s] threads: 1, tps: 216.33, reads: 3027.65, writes: 865.33, response time: 6.21ms (95%), errors: 0.00, reconnects:  0.00
[  21s] threads: 1, tps: 230.33, reads: 3224.69, writes: 921.34, response time: 5.94ms (95%), errors: 0.00, reconnects:  0.00
[  24s] threads: 1, tps: 233.66, reads: 3267.96, writes: 934.66, response time: 5.91ms (95%), errors: 0.00, reconnects:  0.00
[  27s] threads: 1, tps: 220.00, reads: 3084.33, writes: 880.00, response time: 6.04ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 1, tps: 228.33, reads: 3196.67, writes: 913.33, response time: 6.02ms (95%), errors: 0.00, reconnects:  0.00
[  33s] threads: 1, tps: 226.33, reads: 3169.01, writes: 906.67, response time: 6.03ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 1, tps: 213.67, reads: 2991.34, writes: 854.67, response time: 6.10ms (95%), errors: 0.00, reconnects:  0.00
[  39s] threads: 1, tps: 225.33, reads: 3154.67, writes: 900.33, response time: 6.06ms (95%), errors: 0.00, reconnects:  0.00
[  42s] threads: 1, tps: 226.00, reads: 3163.97, writes: 904.99, response time: 6.05ms (95%), errors: 0.00, reconnects:  0.00
[  45s] threads: 1, tps: 223.67, reads: 3131.33, writes: 894.67, response time: 6.08ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 1, tps: 225.33, reads: 3154.68, writes: 900.34, response time: 6.12ms (95%), errors: 0.00, reconnects:  0.00
[  51s] threads: 1, tps: 228.67, reads: 3200.68, writes: 914.34, response time: 6.01ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 1, tps: 220.00, reads: 3080.64, writes: 881.32, response time: 6.04ms (95%), errors: 0.00, reconnects:  0.00
[  57s] threads: 1, tps: 231.67, reads: 3242.32, writes: 925.33, response time: 6.03ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 1, tps: 221.00, reads: 3095.01, writes: 884.00, response time: 6.07ms (95%), errors: 0.00, reconnects:  0.00
[  63s] threads: 1, tps: 208.67, reads: 2921.36, writes: 835.34, response time: 6.15ms (95%), errors: 0.00, reconnects:  0.00
[  66s] threads: 1, tps: 218.33, reads: 3056.65, writes: 874.00, response time: 6.03ms (95%), errors: 0.00, reconnects:  0.00
[  69s] threads: 1, tps: 202.67, reads: 2837.32, writes: 809.33, response time: 6.44ms (95%), errors: 0.00, reconnects:  0.00
[  72s] threads: 1, tps: 204.67, reads: 2862.69, writes: 818.67, response time: 6.50ms (95%), errors: 0.00, reconnects:  0.00
[  75s] threads: 1, tps: 210.00, reads: 2941.31, writes: 839.99, response time: 6.19ms (95%), errors: 0.00, reconnects:  0.00
[  78s] threads: 1, tps: 219.33, reads: 3070.33, writes: 877.33, response time: 6.13ms (95%), errors: 0.00, reconnects:  0.00
[  81s] threads: 1, tps: 213.00, reads: 2980.00, writes: 852.00, response time: 6.19ms (95%), errors: 0.00, reconnects:  0.00
[  84s] threads: 1, tps: 218.67, reads: 3065.00, writes: 876.00, response time: 6.08ms (95%), errors: 0.00, reconnects:  0.00
[  87s] threads: 1, tps: 232.00, reads: 3248.00, writes: 926.67, response time: 5.92ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 1, tps: 223.00, reads: 3118.00, writes: 892.00, response time: 6.01ms (95%), errors: 0.00, reconnects:  0.00
[  93s] threads: 1, tps: 200.67, reads: 2812.32, writes: 802.66, response time: 6.39ms (95%), errors: 0.00, reconnects:  0.00
[  96s] threads: 1, tps: 212.00, reads: 2969.00, writes: 849.33, response time: 6.19ms (95%), errors: 0.00, reconnects:  0.00
[  99s] threads: 1, tps: 216.67, reads: 3032.68, writes: 865.34, response time: 6.12ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            308742
        write:                           88212
        other:                           44106
        total:                           441060
    transactions:                        22053  (220.52 per sec.)
    read/write requests:                 396954 (3969.40 per sec.)
    other operations:                    44106  (441.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0036s
    total number of events:              22053
    total time taken by event execution: 99.9543s
    response time:
         min:                                  2.27ms
         avg:                                  4.53ms
         max:                                 19.00ms
         approx.  95 percentile:               6.09ms

Threads fairness:
    events (avg/stddev):           22053.0000/0.00
    execution time (avg/stddev):   99.9543/0.00